arieger2/ESP32-Treadmill-IDF-PlatformIO/src/ESP32_treadmill_tacho_workout.cpp
    bool selfClosed = tagOpen.endsWith("/");
    int afterOpen = gt + 1;
    int afterTag  = afterOpen;
    if (!selfClosed) {
      String closeSeq = "</" + name + ">";
      int close = xml.indexOf(closeSeq, afterOpen);
      if (close >= 0) afterTag = close + closeSeq.length();
    }

    String attrs = "<" + tagOpen + ">"; // read attributes from opening tag

    if (nameLower == "steadystate") {
      uint32_t dur = 0; float spd=0, inc=0, pwr=0;
      bool hasDur = _getAttrU32(attrs, "Duration", dur);
      bool hasSp  = _getAttrF(attrs,  "Speed",    spd);
      bool hasInc = _getAttrF(attrs,  "Incline",  inc);
      bool hasPwr = _getAttrF(attrs,  "Power",    pwr);
      if (hasDur && dur) {
        float speedKph = hasSp ? spd : (hasPwr ? powerFracToSpeedKph(pwr) : minSpeed_kph);
        push(dur, speedKph, hasInc ? inc : 0.0f, "SteadyState");
      }
    }
    else if (nameLower == "intervalst") {
      uint32_t rep=0, onDur=0, offDur=0;
      float onSp=0, offSp=0, onInc=0, offInc=0, onP=0, offP=0;
      bool hasOnSp  = _getAttrF(attrs, "OnSpeed", onSp);
      bool hasOffSp = _getAttrF(attrs, "OffSpeed", offSp);
      bool hasOnInc = _getAttrF(attrs, "OnIncline", onInc);
      bool hasOffInc= _getAttrF(attrs, "OffIncline", offInc);
      bool hasOnP   = _getAttrF(attrs, "OnPower", onP);
      bool hasOffP  = _getAttrF(attrs, "OffPower", offP);
      _getAttrU32(attrs, "Repeat",     rep);
      _getAttrU32(attrs, "OnDuration", onDur);
      _getAttrU32(attrs, "OffDuration",offDur);

      if (rep && (onDur || offDur)) {
        float onSpeed  = hasOnSp  ? onSp  : (hasOnP  ? powerFracToSpeedKph(onP)  : minSpeed_kph);
        float offSpeed = hasOffSp ? offSp : (hasOffP ? powerFracToSpeedKph(offP) : minSpeed_kph);
        float onIncl   = hasOnInc ? onInc : 0.0f;
        float offIncl  = hasOffInc? offInc: 0.0f;

        for (uint32_t i = 0; i < rep; ++i) {
          if (onDur)  push(onDur,  onSpeed,  onIncl,  "IntervalsT-ON");
          if (offDur) push(offDur, offSpeed, offIncl, "IntervalsT-OFF");
        }
      }
    }
    else if (nameLower == "warmup") {
      uint32_t dur = 0; float pl=0, ph=0, sl=0, sh=0, inc=0;
      bool hasDur = _getAttrU32(attrs, "Duration", dur);
      bool hasPL  = _getAttrF(attrs, "PowerLow",  pl);
      bool hasPH  = _getAttrF(attrs, "PowerHigh", ph);
      bool hasSL  = _getAttrF(attrs, "SpeedLow",  sl);
      bool hasSH  = _getAttrF(attrs, "SpeedHigh", sh);
      bool hasInc = _getAttrF(attrs, "Incline",   inc);
      if (hasDur && dur) {
        float v0 = hasSL ? sl : (hasPL ? powerFracToSpeedKph(pl) : minSpeed_kph);
        float v1 = hasSH ? sh : (hasPH ? powerFracToSpeedKph(ph) : v0);
        pushRamp(dur, v0, v1, hasInc ? inc : 0.0f, "Warmup");
      }
    }
    else if (nameLower == "cooldown") {
      uint32_t dur = 0; float pl=0, ph=0, sl=0, sh=0, inc=0;
      bool hasDur = _getAttrU32(attrs, "Duration", dur);
      bool hasPL  = _getAttrF(attrs, "PowerLow",  pl);
      bool hasPH  = _getAttrF(attrs, "PowerHigh", ph);
      bool hasSL  = _getAttrF(attrs, "SpeedLow",  sl);
      bool hasSH  = _getAttrF(attrs, "SpeedHigh", sh);
      bool hasInc = _getAttrF(attrs, "Incline",   inc);
      if (hasDur && dur) {
        float v0 = hasSL ? sl : (hasPL ? powerFracToSpeedKph(pl) : minSpeed_kph);
        float v1 = hasSH ? sh : (hasPH ? powerFracToSpeedKph(ph) : v0);
        pushRamp(dur, v0, v1, hasInc ? inc : 0.0f, "Cooldown");
      }
    }

    pos = gt + 1;   // keep scanning inside this element
  }

  return true;
}

void WorkoutExecutor::scaleAllSpeeds(float factor) {
  if (factor <= 0.0f) return;
  for (auto &s : _steps) {
    s.speed_kph = _clamp(s.speed_kph * factor, minSpeed_kph, maxSpeed_kph);
  }
  if (_state == WorkoutState::Running && _currentIndex < _steps.size()) {
    _applyTargets(_steps[_currentIndex]); // feel it immediately
  }
}

// -------------------- Utilities --------------------
float WorkoutExecutor::paceToSpeedKph(float paceMin, int units) {
  if (paceMin <= 0) return 0.0f;
  if (units == 0) { // min/mile
    const float km_per_mile = 1.609344f;
    return (60.0f / paceMin) * km_per_mile;
  }
  return 60.0f / paceMin; // min/km
}

float WorkoutExecutor::powerFracToSpeedKph(float frac) const {
  if (frac <= 0) return 0.0f;
  if (zwo_threshold_sec_per_km_ > 0.0f) {
    float vt = 3600.0f / zwo_threshold_sec_per_km_; // km/h at IF=1.0
    return frac * vt;
  }
  return frac * speedAtIF1_kph;  // fallback
}


void writePress(uint8_t pin, bool pressed) {
  if (pin == 0) return;
  
  if (pin == storedGlobals.SPEED_UP_PIN) {
      if (pressed && !speedUpBusy) {
          gpio_set_level((gpio_num_t)pin, 0);  // LOW = relay active
          speedUpBusy = true;
          esp_timer_stop(speedUpTimer);
          esp_timer_start_once(speedUpTimer, PULSE_US);
      }
  } else if (pin == storedGlobals.SPEED_DOWN_PIN) {
      if (pressed && !speedUownBusy) {
          gpio_set_level((gpio_num_t)pin, 0);  // LOW = relay active
          speedUownBusy = true;
          esp_timer_stop(speedDownTimer);
          esp_timer_start_once(speedDownTimer, PULSE_US);
      }
  } else if (pin == storedGlobals.INCLINE_UP_PIN) {
      if (pressed && !inclineUpBusy) {
          gpio_set_level((gpio_num_t)pin, 0);  // LOW = relay active
          inclineUpBusy = true;
          esp_timer_stop(inclineUpTimer);
          esp_timer_start_once(inclineUpTimer, PULSE_US);
      }
  } else if (pin == storedGlobals.INCLINE_DOWN_PIN) {
      if (pressed && !inclineDownBusy) {
          gpio_set_level((gpio_num_t)pin, 0);  // LOW = relay active
          inclineDownBusy = true;
          esp_timer_stop(inclineDownTimer);
          esp_timer_start_once(inclineDownTimer, PULSE_US);
      }
  } else {
      Serial.println("ERROR PIN not defined");
  }
}

// Forward declaration
void pressUntilSpeedChanges(uint8_t pin, bool speedUp, float targetSpeed_kmh);

// ===========================================================================
// ADAPTIVE SPEED CONTROL - Watches actual speed change with hysteresis
// Presses button until speed actually changes, then waits for stabilization
// ===========================================================================
void physicalSpeedControl(float targetSpeed_kmh, float current_mps) {
  static float lastTargetSpeed = -1.0f;
  static bool initialized = false;
  static bool wasRunning = false;
  static uint32_t lastActionTime_ms = 0;
  static float speedBeforeAction = 0.0f;
  static bool waitingForStabilization = false;

  const uint32_t now_ms = millis();

  // Reset on treadmill start
  if (!wasRunning && metrics.isRunning && !metrics.isPaused) {
    initialized = false;
    lastTargetSpeed = -1.0f;
    waitingForStabilization = false;
  }
  
  wasRunning = metrics.isRunning && !metrics.isPaused;
  
  if (!metrics.isRunning || metrics.isPaused) {
    initialized = false;
    lastTargetSpeed = -1.0f;
    waitingForStabilization = false;
    return;
  }
  
  // Safety: Treadmill minimum speed is 1.6 km/h
  if (targetSpeed_kmh < 1.6f) {
    return;
  }
  
  if (!initialized) {
    initialized = true;
    lastTargetSpeed = -1.0f;
    waitingForStabilization = false;
  }

  const float current_kmh = (metrics.mpsSmooth + metrics.mpsOffset) * 3.6f;
  
