arieger2/ESP32-Treadmill-IDF-PlatformIO/src/ESP32_treadmill_tacho_workout.cpp
  // If waiting for stabilization after a button press
  if (waitingForStabilization) {
    // Use INERTIA_DELAY_MS as hysteresis time - wait until speed stabilizes
    if ((now_ms - lastActionTime_ms) < storedGlobals.INERTIA_DELAY_MS) {
      return;  // Still waiting
    }
    // Check if speed has changed from before the action
    float speedChange = fabsf(current_kmh - speedBeforeAction);
    if (speedChange > 0.1f) {
      // Speed changed, stabilization complete
      Serial.printf("[Speed Control] Stabilized: %.1f -> %.1f km/h (change: %.2f)\n",
                    speedBeforeAction, current_kmh, speedChange);
    }
    waitingForStabilization = false;
  }

  const float diff = targetSpeed_kmh - current_kmh;
  const float TOLERANCE = 0.15f;
  
  if (fabsf(diff) <= TOLERANCE) {
    lastTargetSpeed = targetSpeed_kmh;
    return;  // Target reached
  }

  // Log new target
  if (lastTargetSpeed < 0.0f || fabsf(targetSpeed_kmh - lastTargetSpeed) > 0.05f) {
    lastTargetSpeed = targetSpeed_kmh;
    Serial.printf("[Speed Control] Target: %.1f km/h, Current: %.1f km/h, Diff: %.2f km/h\n", 
                  targetSpeed_kmh, current_kmh, diff);
  }

  // Determine direction and pin
  uint8_t pin = (diff > 0) ? storedGlobals.SPEED_UP_PIN : storedGlobals.SPEED_DOWN_PIN;
  if (pin == 0) return;
  
  // Remember speed before action
  speedBeforeAction = current_kmh;
  
  // Press button and watch speed change in real-time
  pressUntilSpeedChanges(pin, diff > 0, targetSpeed_kmh);
  
  lastActionTime_ms = millis();
  waitingForStabilization = true;
}

// ============================================================================
// Calibration-based speed control
// Calculates press duration = diff / rate, subtracts INERTIA_DELAY
// Just press for calculated time, then release and let physicalSpeedControl monitor
// ============================================================================
void pressUntilSpeedChanges(uint8_t pin, bool speedUp, float targetSpeed_kmh) {
  const float startSpeed_kmh = (metrics.mpsSmooth + metrics.mpsOffset) * 3.6f;
  const float MAX_SPEED_KMH = 18.0f;          // Safety: never exceed this
  const float MIN_SPEED_KMH = 1.6f;           // Treadmill minimum
  const uint32_t MAX_PRESS_MS = 30000;        // Safety timeout: 30 seconds max
  const uint32_t MIN_PRESS_MS = 50;           // Minimum press time
  const uint32_t CHECK_INTERVAL_MS = 50;      // Check speed every 50ms (less CPU)
  
  // Safety limits
  if (speedUp && targetSpeed_kmh > MAX_SPEED_KMH) targetSpeed_kmh = MAX_SPEED_KMH;
  if (!speedUp && targetSpeed_kmh < MIN_SPEED_KMH) targetSpeed_kmh = MIN_SPEED_KMH;
  
  // Don't press UP if already at max
  if (speedUp && startSpeed_kmh >= MAX_SPEED_KMH) {
    Serial.printf("[Speed Control] Already at max speed %.1f km/h, not pressing UP\n", startSpeed_kmh);
    return;
  }
  // Don't press DOWN if already at min
  if (!speedUp && startSpeed_kmh <= MIN_SPEED_KMH) {
    Serial.printf("[Speed Control] Already at min speed %.1f km/h, not pressing DOWN\n", startSpeed_kmh);
    return;
  }
  
  // Calculate required press duration from calibration
  const float diff_kmh = fabsf(targetSpeed_kmh - startSpeed_kmh);
  float rate = speedUp ? storedGlobals.SPEED_UP_RATE : storedGlobals.SPEED_DOWN_RATE;
  if (rate < 0.1f) rate = 0.5f;  // Fallback if not calibrated
  
  // Time needed = diff / rate, then subtract INERTIA_DELAY for momentum
  uint32_t calcPress_ms = (uint32_t)((diff_kmh / rate) * 1000.0f);
  uint32_t inertiaComp_ms = storedGlobals.INERTIA_DELAY_MS;
  
  // Reduce press time by inertia delay (the treadmill continues moving after release)
  uint32_t targetPress_ms = (calcPress_ms > inertiaComp_ms) ? (calcPress_ms - inertiaComp_ms) : MIN_PRESS_MS;
  if (targetPress_ms < MIN_PRESS_MS) targetPress_ms = MIN_PRESS_MS;
  if (targetPress_ms > MAX_PRESS_MS) targetPress_ms = MAX_PRESS_MS;
  
  Serial.printf("[Speed Control] %s: %.1f -> %.1f km/h (diff=%.2f, rate=%.3f, calc=%u ms, inertia=%u ms, press=%u ms)\n",
                speedUp ? "UP" : "DOWN", startSpeed_kmh, targetSpeed_kmh, 
                diff_kmh, rate, calcPress_ms, inertiaComp_ms, targetPress_ms);
  
  // Activate relay and press for calculated duration
  digitalWrite(pin, LOW);
  
  uint32_t startTime = millis();
  uint32_t elapsed = 0;
  uint32_t lastSensorUpdate = 0;
  
  // Simple loop: press for targetPress_ms, only checking safety limits
  // Use vTaskDelay instead of delay() to ensure WiFi/HTTP tasks get CPU time
  float lastSpeed_kmh = startSpeed_kmh;
  uint32_t noChangeCount = 0;
  const uint32_t NO_CHANGE_THRESHOLD = 3;  // Stop after 3 checks (~1.5s) with no speed change
  
  while (elapsed < targetPress_ms) {
    vTaskDelay(pdMS_TO_TICKS(CHECK_INTERVAL_MS));  // FreeRTOS delay - yields to other tasks
    elapsed = millis() - startTime;
    
    // Metrics are updated automatically by ISR callbacks - no manual update needed
    // OLD SYSTEM REMOVED: Previously called updateMetricsMotor/Band here
    if (elapsed - lastSensorUpdate >= 500) {
      lastSensorUpdate = elapsed;
      
      // Check if speed is still changing in the expected direction
      float currentSpeed_kmh = (metrics.mpsSmooth + metrics.mpsOffset) * 3.6f;
      float speedChange = currentSpeed_kmh - lastSpeed_kmh;
      
      // For UP: speed should increase (positive change)
      // For DOWN: speed should decrease (negative change)
      bool expectedChange = speedUp ? (speedChange > 0.05f) : (speedChange < -0.05f);
      
      if (!expectedChange && elapsed > 1000) {  // Only check after 1 second
        noChangeCount++;
        if (noChangeCount >= NO_CHANGE_THRESHOLD) {
          Serial.printf("[Speed Control] No more %s change detected after %u ms at %.1f km/h\n",
                        speedUp ? "UP" : "DOWN", elapsed, currentSpeed_kmh);
          break;
        }
      } else {
        noChangeCount = 0;  // Reset counter if speed is changing
      }
      
      lastSpeed_kmh = currentSpeed_kmh;
    }
    
    float currentSpeed_kmh = (metrics.mpsSmooth + metrics.mpsOffset) * 3.6f;
    
